emacs-tips.org
# -*- mode:org; coding:utf-8-unix -*-

#+TITLE: Emacs Tips
#+STARTUP: indent

* For the absolute beginner
Press Control + 'h' then 't'.
** Finding more information
- Help Index
  - =C-h ?=
- Symbol Search
  - =M-x apropos RET=
- Emacs
  - Emacs Manual (=C-h r= or =C-h i m emacs=)
    - info:emacs
- Emacs Lisp
  - Introduction to Programming in Emacs Lisp (=C-h i m Emacs Lisp Intro=)
    - info:eintr
  - Emacs Lisp Reference Manual (=C-h i m Elisp=)
    - info:elisp
* Shortcuts/Key Bindings
** Help/Discovery/Diagnostics
- =C-h ? b= :: Display all key bindings
- =C-h b= :: Display all key bindings
- =C-h k= :: Describe a key binding
- =C-h c= :: Describe a key binding briefly
- =C-h m= :: Describe current major and minor modes
- =C-c C-h= :: show all bindings starting with "C-c" prefix
- =C-x C-h= :: show all bindings starting with "C-x" prefix
- =C-x c C-h= :: show all bindings starting with "C-x c" prefix
** Info Pages
Info pages are a rich and reliable source of information.
- =C-h i= :: open info directory
- =TAB= :: next link
- =S-TAB= :: previous link
- =c= :: copy name of the current info node
- =M-x info-apropos= :: search in the indices of all manuals
- =?= :: open summary of all info commands
- =d= :: go to info directoy
- =m= :: go to a menu item
- =s= :: regexp search document
- =C-s= :: incremental search forward
- =C-r= :: incremental search backward
- =I= :: search in the indices of current manual
- =n= :: next
- =p= :: previous
- =u= :: up
- =t= :: top
- =q= :: quit (selects previous buffer)

Searching goes through multiple Info nodes, see [[info:info#Search Text][(info) Search Text]] for
more information.
** Text Searching
- =C-s= :: incremental search forward
- =C-r= :: incremental search backward
- =C-M-s= :: incremental search forward (regular expression)
- =C-M-r= :: incremental search backward (regular expression)
** Text Selection and Basic Editing
- =C-SPC= :: set-mark-command (start selection)
- =C-w= :: kill-region (cut)
- =M-w= :: kill-ring-save (copy)
- =C-y= :: yank (paste)
- =C-x h= :: mark-whole-buffer
** Keyboard Macros
- =C-x (= :: kmacro-start-macro
- =C-x )= :: kmacro-end-macro
- =C-x e= :: kmacro-end-and-call-macro

See [[info:emacs#Keyboard Macros][(emacs) Keyboard Macros]] for more information.
** Lisp evaluation
- =M-:=
- =C-x C-e=
- =C-M-x=
- =M-x ielm=
- =M-x eshell=

You really should known what each of these do, also remember that =C-h
k= is a great friend.
** Eshell
- =M-p= :: previous command (match prefix)
- =M-n= :: next command (match prefix)
- =C-c C-c= :: eshell-interrupt-process
- =C-c C-p= :: eshell-previous-prompt
- =C-c C-n= :: eshell-next-prompt
- =C-c C-l= :: eshell-list-history
* File Variables
File variables are important to select and customize major and minor
modes in a file-by-file basis, see [[info:emacs#Specifying File Variables][Specifying File Variables]]

How to access/examine/inspect file variables? <elisp:(symbol-value
'file-local-variables-alist)>, this variable may be nil, as it is best
practice to remove them as they are consumed by their handling modes.

See also:
- [[info:emacs#Directory Variables][Directory Variables]]
* Org Mode Tips
** Shortcuts
*** Basics and navigation.
- =TAB= / =S-TAB= :: (un)fold
- =M-up= / =M-down= :: move a headline up or down
- =M-left= / =M-right= :: promote or demote a headline
- =M-S-left= / =M-S-right= :: promote or demote a subtree
- =C-RET= :: insert a new headline
- =M-RET= :: insert a new item
- =C-c C-w= :: move entries
- =C-c -= :: change list style
- =C-c / t= :: show TODOs in current document
- =S-left= / =S-right= :: very useful, depends on context
- =C-c C-c= :: context-dependant, toggle checkboxes, tagging
- =C-c C-o= :: opens link
- =C-c C-e= :: export menu (try 'h' then 'o')
- =C-c C-e C-s= :: export scope configuration
- =C-c C-z= :: take note
- =C-c C-t= :: cycle task states
- =C-u 5 C-c C-t= :: set 5th task state (or clean it if 5th is not
  set)
