emacs-tips.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-12 Sat 15:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Tips</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="user01" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Tips</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org90417eb">1. For the absolute beginner</a>
<ul>
<li><a href="#orgd8a8ac2">1.1. Finding more information</a></li>
</ul>
</li>
<li><a href="#orgbeae075">2. Shortcuts/Key Bindings</a>
<ul>
<li><a href="#org079ed28">2.1. Help/Discovery/Diagnostics</a></li>
<li><a href="#org67b9d11">2.2. Info Pages</a></li>
<li><a href="#org3cbf504">2.3. Text Searching</a></li>
<li><a href="#org1454a36">2.4. Text Selection and Basic Editing</a></li>
<li><a href="#orgf3309a9">2.5. Keyboard Macros</a></li>
<li><a href="#org3d31c1c">2.6. Lisp evaluation</a></li>
<li><a href="#orge93b350">2.7. Eshell</a></li>
</ul>
</li>
<li><a href="#org949f3b8">3. File Variables</a></li>
<li><a href="#org51651b5">4. Org Mode Tips</a>
<ul>
<li><a href="#org9595d11">4.1. Shortcuts</a>
<ul>
<li><a href="#org3ce1e4a">4.1.1. Basics and navigation.</a></li>
<li><a href="#orgeadb16b">4.1.2. Miscellaneous</a></li>
</ul>
</li>
<li><a href="#org38df487">4.2. Links</a></li>
<li><a href="#org240bda2">4.3. Examples</a>
<ul>
<li><a href="#orge8e045d">4.3.1. Lord of the Rings (from org4beginners, see references)</a></li>
<li><a href="#org242a91a">4.3.2. Text Markups</a></li>
<li><a href="#org9c3a1de">4.3.3. Checkboxes</a></li>
</ul>
</li>
<li><a href="#orgf194b9f">4.4. Export</a>
<ul>
<li><a href="#org9071e50">4.4.1. Shortcuts</a></li>
<li><a href="#orgeff4bab">4.4.2. References</a></li>
</ul>
</li>
<li><a href="#org5fcdaee">4.5. Configuration</a>
<ul>
<li><a href="#orgbb1c051">4.5.1. Change default workflow states</a></li>
<li><a href="#org6fbc1d3">4.5.2. Add timestamp when tasks are DONE</a></li>
<li><a href="#org829e96f">4.5.3. Add nice indentation and other configurations</a></li>
</ul>
</li>
<li><a href="#org1e5a7d7">4.6. Evaluation of Code Blocks</a></li>
<li><a href="#org153738b">4.7. More Shortcuts</a></li>
<li><a href="#org89ccb56">4.8. References</a></li>
</ul>
</li>
<li><a href="#orge3926a6">5. IDO Tips</a>
<ul>
<li><a href="#org33f1108">5.1. Shortcuts for ido-find-file</a></li>
<li><a href="#org401a87a">5.2. Shortcuts for ido-switch-buffer</a></li>
<li><a href="#org05e9b66">5.3. References</a></li>
</ul>
</li>
<li><a href="#org8c0f187">6. Lisp Debugging</a></li>
<li><a href="#org303958b">7. Emacs/Elisp Troubleshooting</a>
<ul>
<li><a href="#org1c5a9db">7.1. Font test</a></li>
<li><a href="#org7b43a1a">7.2. Controlled startup</a></li>
</ul>
</li>
<li><a href="#org7ded88d">8. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org90417eb" class="outline-2">
<h2 id="org90417eb"><span class="section-number-2">1</span> For the absolute beginner</h2>
<div class="outline-text-2" id="text-1">
<p>
Press Control + 'h' then 't'.
</p>
</div>
<div id="outline-container-orgd8a8ac2" class="outline-3">
<h3 id="orgd8a8ac2"><span class="section-number-3">1.1</span> Finding more information</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Help Index
<ul class="org-ul">
<li><code>C-h ?</code></li>
</ul></li>
<li>Symbol Search
<ul class="org-ul">
<li><code>M-x apropos RET</code></li>
</ul></li>
<li>Emacs
<ul class="org-ul">
<li>Emacs Manual (<code>C-h r</code> or <code>C-h i m emacs</code>)
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Top">emacs</a></li>
</ul></li>
</ul></li>
<li>Emacs Lisp
<ul class="org-ul">
<li>Introduction to Programming in Emacs Lisp (<code>C-h i m Emacs Lisp Intro</code>)
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_mono/eintr.html#Top">eintr</a></li>
</ul></li>
<li>Emacs Lisp Reference Manual (<code>C-h i m Elisp</code>)
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Top">elisp</a></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbeae075" class="outline-2">
<h2 id="orgbeae075"><span class="section-number-2">2</span> Shortcuts/Key Bindings</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org079ed28" class="outline-3">
<h3 id="org079ed28"><span class="section-number-3">2.1</span> Help/Discovery/Diagnostics</h3>
<div class="outline-text-3" id="text-2-1">
<dl class="org-dl">
<dt><code>C-h ? b</code></dt><dd>Display all key bindings</dd>
<dt><code>C-h b</code></dt><dd>Display all key bindings</dd>
<dt><code>C-h k</code></dt><dd>Describe a key binding</dd>
<dt><code>C-h c</code></dt><dd>Describe a key binding briefly</dd>
<dt><code>C-h m</code></dt><dd>Describe current major and minor modes</dd>
<dt><code>C-c C-h</code></dt><dd>show all bindings starting with "C-c" prefix</dd>
<dt><code>C-x C-h</code></dt><dd>show all bindings starting with "C-x" prefix</dd>
<dt><code>C-x c C-h</code></dt><dd>show all bindings starting with "C-x c" prefix</dd>
</dl>
</div>
</div>
<div id="outline-container-org67b9d11" class="outline-3">
<h3 id="org67b9d11"><span class="section-number-3">2.2</span> Info Pages</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Info pages are a rich and reliable source of information.
</p>
<dl class="org-dl">
<dt><code>C-h i</code></dt><dd>open info directory</dd>
<dt><code>TAB</code></dt><dd>next link</dd>
<dt><code>S-TAB</code></dt><dd>previous link</dd>
<dt><code>c</code></dt><dd>copy name of the current info node</dd>
<dt><code>M-x info-apropos</code></dt><dd>search in the indices of all manuals</dd>
<dt><code>?</code></dt><dd>open summary of all info commands</dd>
<dt><code>d</code></dt><dd>go to info directoy</dd>
<dt><code>m</code></dt><dd>go to a menu item</dd>
<dt><code>s</code></dt><dd>regexp search document</dd>
<dt><code>C-s</code></dt><dd>incremental search forward</dd>
<dt><code>C-r</code></dt><dd>incremental search backward</dd>
<dt><code>I</code></dt><dd>search in the indices of current manual</dd>
<dt><code>n</code></dt><dd>next</dd>
<dt><code>p</code></dt><dd>previous</dd>
<dt><code>u</code></dt><dd>up</dd>
<dt><code>t</code></dt><dd>top</dd>
<dt><code>q</code></dt><dd>quit (selects previous buffer)</dd>
</dl>

<p>
Searching goes through multiple Info nodes, see <a href="https://www.gnu.org/software/emacs/manual/html_mono/info.html#Search-Text">(info) Search Text</a> for
more information.
</p>
</div>
</div>
<div id="outline-container-org3cbf504" class="outline-3">
<h3 id="org3cbf504"><span class="section-number-3">2.3</span> Text Searching</h3>
<div class="outline-text-3" id="text-2-3">
<dl class="org-dl">
<dt><code>C-s</code></dt><dd>incremental search forward</dd>
<dt><code>C-r</code></dt><dd>incremental search backward</dd>
<dt><code>C-M-s</code></dt><dd>incremental search forward (regular expression)</dd>
<dt><code>C-M-r</code></dt><dd>incremental search backward (regular expression)</dd>
</dl>
</div>
</div>
<div id="outline-container-org1454a36" class="outline-3">
<h3 id="org1454a36"><span class="section-number-3">2.4</span> Text Selection and Basic Editing</h3>
<div class="outline-text-3" id="text-2-4">
<dl class="org-dl">
<dt><code>C-SPC</code></dt><dd>set-mark-command (start selection)</dd>
<dt><code>C-w</code></dt><dd>kill-region (cut)</dd>
<dt><code>M-w</code></dt><dd>kill-ring-save (copy)</dd>
<dt><code>C-y</code></dt><dd>yank (paste)</dd>
<dt><code>C-x h</code></dt><dd>mark-whole-buffer</dd>
</dl>
</div>
</div>
<div id="outline-container-orgf3309a9" class="outline-3">
<h3 id="orgf3309a9"><span class="section-number-3">2.5</span> Keyboard Macros</h3>
<div class="outline-text-3" id="text-2-5">
<dl class="org-dl">
<dt><code>C-x (</code></dt><dd>kmacro-start-macro</dd>
<dt><code>C-x )</code></dt><dd>kmacro-end-macro</dd>
<dt><code>C-x e</code></dt><dd>kmacro-end-and-call-macro</dd>
</dl>

<p>
See <a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Keyboard-Macros">(emacs) Keyboard Macros</a> for more information.
</p>
</div>
</div>
<div id="outline-container-org3d31c1c" class="outline-3">
<h3 id="org3d31c1c"><span class="section-number-3">2.6</span> Lisp evaluation</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><code>M-:</code></li>
<li><code>C-x C-e</code></li>
<li><code>C-M-x</code></li>
<li><code>M-x ielm</code></li>
<li><code>M-x eshell</code></li>
</ul>

<p>
You really should known what each of these do, also remember that <code>C-h
k</code> is a great friend.
</p>
</div>
</div>
<div id="outline-container-orge93b350" class="outline-3">
<h3 id="orge93b350"><span class="section-number-3">2.7</span> Eshell</h3>
<div class="outline-text-3" id="text-2-7">
<dl class="org-dl">
<dt><code>M-p</code></dt><dd>previous command (match prefix)</dd>
<dt><code>M-n</code></dt><dd>next command (match prefix)</dd>
<dt><code>C-c C-c</code></dt><dd>eshell-interrupt-process</dd>
<dt><code>C-c C-p</code></dt><dd>eshell-previous-prompt</dd>
<dt><code>C-c C-n</code></dt><dd>eshell-next-prompt</dd>
<dt><code>C-c C-l</code></dt><dd>eshell-list-history</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-org949f3b8" class="outline-2">
<h2 id="org949f3b8"><span class="section-number-2">3</span> File Variables</h2>
<div class="outline-text-2" id="text-3">
<p>
File variables are important to select and customize major and minor
modes in a file-by-file basis, see <a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Specifying-File-Variables">Specifying File Variables</a>
</p>

<p>
How to access/examine/inspect file variables? <a href="(symbol-value'file-local-variables-alist)">(symbol-value'file-local-variables-alist)</a>, this variable may be nil, as it is best
practice to remove them as they are consumed by their handling modes.
</p>

<p>
See also:
</p>
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_mono/emacs.html#Directory-Variables">Directory Variables</a></li>
</ul>
</div>
</div>
<div id="outline-container-org51651b5" class="outline-2">
<h2 id="org51651b5"><span class="section-number-2">4</span> Org Mode Tips</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9595d11" class="outline-3">
<h3 id="org9595d11"><span class="section-number-3">4.1</span> Shortcuts</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org3ce1e4a" class="outline-4">
<h4 id="org3ce1e4a"><span class="section-number-4">4.1.1</span> Basics and navigation.</h4>
<div class="outline-text-4" id="text-4-1-1">
<dl class="org-dl">
<dt><code>TAB</code> / <code>S-TAB</code></dt><dd>(un)fold</dd>
<dt><code>M-up</code> / <code>M-down</code></dt><dd>move a headline up or down</dd>
<dt><code>M-left</code> / <code>M-right</code></dt><dd>promote or demote a headline</dd>
<dt><code>C-RET</code></dt><dd>insert a new headline</dd>
<dt><code>M-RET</code></dt><dd>insert a new item</dd>
<dt><code>C-c C-w</code></dt><dd>move entries</dd>
<dt><code>C-c -</code></dt><dd>change list style</dd>
<dt><code>C-c / t</code></dt><dd>show TODOs in current document</dd>
<dt><code>S-left</code> / <code>S-right</code></dt><dd>very useful, depends on context</dd>
<dt><code>C-c C-c</code></dt><dd>context-dependant, toggle checkboxes, tagging</dd>
<dt><code>C-c C-o</code></dt><dd>opens link</dd>
<dt><code>C-c C-e</code></dt><dd>export menu (try 'h' then 'o')</dd>
<dt><code>C-c C-e C-s</code></dt><dd>export scope configuration</dd>
<dt><code>C-c C-z</code></dt><dd>take note</dd>
<dt><code>C-c C-t</code></dt><dd>cycle task states</dd>
<dt><code>C-u 5 C-c C-t</code></dt><dd>set 5th task state (or clean it if 5th is not
set)</dd>
</dl>
</div>
</div>
