emacs-tips.org
*** Miscellaneous
- =C-c C-,= :: org-insert-structure-template (e.g. insert =being_src=
  blocks)
- =C-c '= :: org-edit-special, org-edit-export-block and others
- =C-c $= or =C-c C-x C-s= :: org-archive-subtree
** Links
- explict using angular/angle brackets: <info:eintr#Symbols as Chest>
- implict/nice/rich using square brackets: [[info:eintr#Symbols as Chest][eintr: Symbols as Chest]]
** Examples
*** Lord of the Rings (from org4beginners, see references)
My favorite scenes are (in this order)
1. The attack of the Rohirrim
2. Eowyn's fight with the witch king
   1. this was already my favorite scene in the book
   2. I really like Miranda Otto.
3. Peter Jackson being shot by Legolas
   1. on DVD only
   He makes a really funny face when it happens.
   But in the end, no individual scenes matter but the film as a whole.
   Important actors in this film are:
   - Elijah Wood :: He plays Frodo
   - Sean Austin :: He plays Sam, Frodo's friend.  I still remember
                    him very well from his role as Mikey Walsh in The Goonies.
*** Text Markups
You can make words *bold*, /italic/, _underlined_, =code= and
~verbatim~, and, if you must, +strike-through+.
*** Checkboxes
**** Basic [1/2] [50%]
- [ ] an item
- [X] uset C-c C-c to toggle
**** Sublists
- [-] Group 1
  + [ ] item 1
  + [X] item 2
- [1/2] Group 2
  + [ ] item 1
  + [X] item 2
- [50%] Group 3
  + [ ] item 1
  + [X] item 2
- [1/2] Group 4 (does not count subitems)
  * [X] item 1
  * [-] item 2
    1. [X] subitem 2.1
    2. [ ] subitem 2.2
- [50%] Group 5 (does not count subitems)
  * [X] item 1
  * [-] item 2
    1. [X] subitem 2.1
    2. [ ] subitem 2.2
** Export
*** Shortcuts
- HTML
  - =C-c C-e h h= (=M-x org-html-export-to-html=)
  - =C-c C-e h H= (=M-x org-html-export-as-html=)
  - =C-c C-e h o= (=C-u M-x org-html-export-to-html=)
    - exports and open in browser
  - =M-x org-html-convert-region-to-html=
    - insert html in current buffer at point
- LaTeX
  - =C-c C-e l l= (=M-x org-latex-export-to-latex=)
*** References
- =M-:= then =(info-other-window "(org) HTML export commands")=
- =M-:= then =(info-other-window "(org) LaTeX/PDF export commands")=
** Configuration
*** Change default workflow states
Add this to your initialization script:
#+begin_src emacs-lisp
(setq org-todo-keywords
  '((sequence "TODO" "IN-PROGRESS" "WAITING" "WONTDO" "DONE")))
#+end_src
*** Add timestamp when tasks are DONE
#+begin_src conf
  ,#+STARTUP: logdone
#+end_src
*** Add nice indentation and other configurations
#+begin_src conf
  ,#+STARTUP: indent logdone
#+end_src
** Evaluation of Code Blocks
- [[info:org#Evaluating code blocks][(org) Evaluating code blocks]]
- [[info:org#Results of evaluation][(org) Results of evaluation]]
** More Shortcuts
- =M-2 C-c .= :: insert timestamp
** References
Some nice material.
- https://orgmode.org/worg/org-tutorials/org4beginners.html
  - https://bzg.fr/en/org-playing-with-lists-screencast.html/
* IDO Tips
=C-s=, =C-r=, =C-f=, =C-d=, =C-e=, =C-j= are really useful, learn how
to use them.
** Shortcuts for ido-find-file
#+begin_src text
  RET     Select the file at the front of the list of matches.
  If the list is empty, possibly prompt to create new file.

  C-j     Use the current input string verbatim.

  C-s     Put the first element at the end of the list.
  C-r     Put the last element at the start of the list.
  TAB     Complete a common suffix to the current string that matches
  all files.  If there is only one match, select that file.
  If there is no common suffix, show a list of all matching files
  in a separate window.
  C-d     Open the specified directory in Dired mode.
  C-e     Edit input string (including directory).
  M-p     Go to previous directory in work directory history.
  M-n     Go to next directory in work directory history.
  M-s     Search for file in the work directory history.
  M-k     Remove current directory from the work directory history.
  M-o     Cycle to previous file in work file history.
  C-M-o   Cycle to next file in work file history.
  M-f     Prompt for a file and use find to locate it.
  M-d     Prompt for a directory and use find to locate it.
  M-m     Prompt for a directory to create in current directory.
  C-x C-f Fallback to non-Ido version of current command.
  C-t     Toggle regexp searching.
  C-p     Toggle between substring and prefix matching.
  C-c     Toggle case-sensitive searching of file names.
  M-l     Toggle literal reading of this file.
  ?       Show list of matching files in separate window.
  C-a     Toggle ignoring files listed in ‘ido-ignore-files’.
#+end_src
