emacs-tips.html
<div id="outline-container-orgeadb16b" class="outline-4">
<h4 id="orgeadb16b"><span class="section-number-4">4.1.2</span> Miscellaneous</h4>
<div class="outline-text-4" id="text-4-1-2">
<dl class="org-dl">
<dt><code>C-c C-,</code></dt><dd>org-insert-structure-template (e.g. insert being<sub>src</sub>
blocks)</dd>
<dt><code>C-c '</code></dt><dd>org-edit-special, org-edit-export-block and others</dd>
<dt><code>C-c $</code> or <code>C-c C-x C-s</code></dt><dd>org-archive-subtree</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-org38df487" class="outline-3">
<h3 id="org38df487"><span class="section-number-3">4.2</span> Links</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>explict using angular/angle brackets: <a href="https://www.gnu.org/software/emacs/manual/html_mono/eintr.html#Symbols-as-Chest">eintr#Symbols as Chest</a></li>
<li>implict/nice/rich using square brackets: <a href="https://www.gnu.org/software/emacs/manual/html_mono/eintr.html#Symbols-as-Chest">eintr: Symbols as Chest</a></li>
</ul>
</div>
</div>
<div id="outline-container-org240bda2" class="outline-3">
<h3 id="org240bda2"><span class="section-number-3">4.3</span> Examples</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orge8e045d" class="outline-4">
<h4 id="orge8e045d"><span class="section-number-4">4.3.1</span> Lord of the Rings (from org4beginners, see references)</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
My favorite scenes are (in this order)
</p>
<ol class="org-ol">
<li>The attack of the Rohirrim</li>
<li>Eowyn's fight with the witch king
<ol class="org-ol">
<li>this was already my favorite scene in the book</li>
<li>I really like Miranda Otto.</li>
</ol></li>
<li><p>
Peter Jackson being shot by Legolas
</p>
<ol class="org-ol">
<li>on DVD only</li>
</ol>
<p>
He makes a really funny face when it happens.
But in the end, no individual scenes matter but the film as a whole.
Important actors in this film are:
</p>
<dl class="org-dl">
<dt>Elijah Wood</dt><dd>He plays Frodo</dd>
<dt>Sean Austin</dt><dd>He plays Sam, Frodo's friend.  I still remember
him very well from his role as Mikey Walsh in The Goonies.</dd>
</dl></li>
</ol>
</div>
</div>
<div id="outline-container-org242a91a" class="outline-4">
<h4 id="org242a91a"><span class="section-number-4">4.3.2</span> Text Markups</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
You can make words <b>bold</b>, <i>italic</i>, <span class="underline">underlined</span>, <code>code</code> and
<code>verbatim</code>, and, if you must, <del>strike-through</del>.
</p>
</div>
</div>
<div id="outline-container-org9c3a1de" class="outline-4">
<h4 id="org9c3a1de"><span class="section-number-4">4.3.3</span> Checkboxes</h4>
<div class="outline-text-4" id="text-4-3-3">
</div>
<ol class="org-ol">
<li><a id="org74571c7"></a>Basic <code>[1/2]</code> <code>[50%]</code><br />
<div class="outline-text-5" id="text-4-3-3-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> an item</li>
<li class="on"><code>[X]</code> uset C-c C-c to toggle</li>
</ul>
</div>
</li>
<li><a id="org39493f0"></a>Sublists<br />
<div class="outline-text-5" id="text-4-3-3-2">
<ul class="org-ul">
<li class="trans"><code>[-]</code> Group 1
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> item 1</li>
<li class="on"><code>[X]</code> item 2</li>
</ul></li>
<li><code>[1/2]</code> Group 2
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> item 1</li>
<li class="on"><code>[X]</code> item 2</li>
</ul></li>
<li><code>[50%]</code> Group 3
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> item 1</li>
<li class="on"><code>[X]</code> item 2</li>
</ul></li>
<li><code>[1/2]</code> Group 4 (does not count subitems)
<ul class="org-ul">
<li class="on"><code>[X]</code> item 1</li>
<li class="trans"><code>[-]</code> item 2
<ol class="org-ol">
<li class="on"><code>[X]</code> subitem 2.1</li>
<li class="off"><code>[&#xa0;]</code> subitem 2.2</li>
</ol></li>
</ul></li>
<li><code>[50%]</code> Group 5 (does not count subitems)
<ul class="org-ul">
<li class="on"><code>[X]</code> item 1</li>
<li class="trans"><code>[-]</code> item 2
<ol class="org-ol">
<li class="on"><code>[X]</code> subitem 2.1</li>
<li class="off"><code>[&#xa0;]</code> subitem 2.2</li>
</ol></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgf194b9f" class="outline-3">
<h3 id="orgf194b9f"><span class="section-number-3">4.4</span> Export</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org9071e50" class="outline-4">
<h4 id="org9071e50"><span class="section-number-4">4.4.1</span> Shortcuts</h4>
<div class="outline-text-4" id="text-4-4-1">
<ul class="org-ul">
<li>HTML
<ul class="org-ul">
<li><code>C-c C-e h h</code> (<code>M-x org-html-export-to-html</code>)</li>
<li><code>C-c C-e h H</code> (<code>M-x org-html-export-as-html</code>)</li>
<li><code>C-c C-e h o</code> (<code>C-u M-x org-html-export-to-html</code>)
<ul class="org-ul">
<li>exports and open in browser</li>
</ul></li>
<li><code>M-x org-html-convert-region-to-html</code>
<ul class="org-ul">
<li>insert html in current buffer at point</li>
</ul></li>
</ul></li>
<li>LaTeX
<ul class="org-ul">
<li><code>C-c C-e l l</code> (<code>M-x org-latex-export-to-latex</code>)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgeff4bab" class="outline-4">
<h4 id="orgeff4bab"><span class="section-number-4">4.4.2</span> References</h4>
<div class="outline-text-4" id="text-4-4-2">
<ul class="org-ul">
<li><code>M-:</code> then <code>(info-other-window "(org) HTML export commands")</code></li>
<li><code>M-:</code> then <code>(info-other-window "(org) LaTeX/PDF export commands")</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5fcdaee" class="outline-3">
<h3 id="org5fcdaee"><span class="section-number-3">4.5</span> Configuration</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-orgbb1c051" class="outline-4">
<h4 id="orgbb1c051"><span class="section-number-4">4.5.1</span> Change default workflow states</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
Add this to your initialization script:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-todo-keywords
  '((sequence "TODO" "IN-PROGRESS" "WAITING" "WONTDO" "DONE")))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6fbc1d3" class="outline-4">
<h4 id="org6fbc1d3"><span class="section-number-4">4.5.2</span> Add timestamp when tasks are DONE</h4>
<div class="outline-text-4" id="text-4-5-2">
<div class="org-src-container">
<pre class="src src-conf">#+STARTUP: logdone
</pre>
</div>
</div>
</div>
<div id="outline-container-org829e96f" class="outline-4">
<h4 id="org829e96f"><span class="section-number-4">4.5.3</span> Add nice indentation and other configurations</h4>
<div class="outline-text-4" id="text-4-5-3">
<div class="org-src-container">
<pre class="src src-conf">#+STARTUP: indent logdone
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1e5a7d7" class="outline-3">
<h3 id="org1e5a7d7"><span class="section-number-3">4.6</span> Evaluation of Code Blocks</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li><a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Evaluating-code-blocks">(org) Evaluating code blocks</a></li>
<li><a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Results-of-evaluation">(org) Results of evaluation</a></li>
</ul>
</div>
</div>
<div id="outline-container-org153738b" class="outline-3">
<h3 id="org153738b"><span class="section-number-3">4.7</span> More Shortcuts</h3>
<div class="outline-text-3" id="text-4-7">
<dl class="org-dl">
<dt><code>M-2 C-c .</code></dt><dd>insert timestamp</dd>
</dl>
</div>
</div>
<div id="outline-container-org89ccb56" class="outline-3">
<h3 id="org89ccb56"><span class="section-number-3">4.8</span> References</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Some nice material.
</p>
<ul class="org-ul">
<li><a href="https://orgmode.org/worg/org-tutorials/org4beginners.html">https://orgmode.org/worg/org-tutorials/org4beginners.html</a>
<ul class="org-ul">
<li><a href="https://bzg.fr/en/org-playing-with-lists-screencast.html/">https://bzg.fr/en/org-playing-with-lists-screencast.html/</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge3926a6" class="outline-2">
<h2 id="orge3926a6"><span class="section-number-2">5</span> IDO Tips</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>C-s</code>, <code>C-r</code>, <code>C-f</code>, <code>C-d</code>, <code>C-e</code>, <code>C-j</code> are really useful, learn how
to use them.
</p>
</div>
<div id="outline-container-org33f1108" class="outline-3">
<h3 id="org33f1108"><span class="section-number-3">5.1</span> Shortcuts for ido-find-file</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-text">RET     Select the file at the front of the list of matches.
If the list is empty, possibly prompt to create new file.

C-j     Use the current input string verbatim.

C-s     Put the first element at the end of the list.
C-r     Put the last element at the start of the list.
TAB     Complete a common suffix to the current string that matches
all files.  If there is only one match, select that file.
If there is no common suffix, show a list of all matching files
in a separate window.
C-d     Open the specified directory in Dired mode.
C-e     Edit input string (including directory).
M-p     Go to previous directory in work directory history.
M-n     Go to next directory in work directory history.
M-s     Search for file in the work directory history.
M-k     Remove current directory from the work directory history.
M-o     Cycle to previous file in work file history.
C-M-o   Cycle to next file in work file history.
M-f     Prompt for a file and use find to locate it.
M-d     Prompt for a directory and use find to locate it.
M-m     Prompt for a directory to create in current directory.
C-x C-f Fallback to non-Ido version of current command.
C-t     Toggle regexp searching.
C-p     Toggle between substring and prefix matching.
C-c     Toggle case-sensitive searching of file names.
M-l     Toggle literal reading of this file.
?       Show list of matching files in separate window.
C-a     Toggle ignoring files listed in ‘ido-ignore-files’.
</pre>
</div>
</div>
</div>
