emacs-tips.org
** Shortcuts for ido-switch-buffer
#+begin_src text
  RET     Select the buffer at the front of the list of matches.
          If the list is empty, possibly prompt to create new buffer.

  C-j     Use the current input string verbatim.

  C-s     Put the first element at the end of the list.
  C-r     Put the last element at the start of the list.
  TAB     Complete a common suffix to the current string that matches
          all buffers.  If there is only one match, select that buffer.
          If there is no common suffix, show a list of all matching buffers
          in a separate window.
  C-e     Edit input string.
  C-x C-b Fallback to non-ido version of current command.
  C-t     Toggle regexp searching.
  C-p     Toggle between substring and prefix matching.
  C-c     Toggle case-sensitive searching of buffer names.
  ?       Show list of matching buffers in separate window.
  C-x C-f Drop into ‘ido-find-file’.
  C-k     Kill buffer at head of buffer list.
  C-a     Toggle ignoring buffers listed in ‘ido-ignore-buffers’.
#+end_src
** References
- http://ergoemacs.org/emacs/emacs_ido_mode.html
- C-h f ido-find-file RET
- C-h f ido-switch-buffer RET
* Slime Basics
Slime can be seem as a Lisp IDE

- =C-c C-k= :: compile whole file into an FASL file
- =C-c C-c= :: compile an individual block

* Lisp Debugging
* Emacs/Elisp Troubleshooting
** Font test
- =C-h h= :: view-hello-file
** Controlled startup
See [[info:org#Batch execution][(org) Batch execution]] for an example using =-Q=, =--batch= and
=--eval= flags.
* References
- https://github.com/chrisdone/elisp-guide
- =M-:= then =(info-other-window "(emacs) Specifying File Variables")=
