emacs-tips.html
<div id="outline-container-org401a87a" class="outline-3">
<h3 id="org401a87a"><span class="section-number-3">5.2</span> Shortcuts for ido-switch-buffer</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-text">RET     Select the buffer at the front of the list of matches.
        If the list is empty, possibly prompt to create new buffer.

C-j     Use the current input string verbatim.

C-s     Put the first element at the end of the list.
C-r     Put the last element at the start of the list.
TAB     Complete a common suffix to the current string that matches
        all buffers.  If there is only one match, select that buffer.
        If there is no common suffix, show a list of all matching buffers
        in a separate window.
C-e     Edit input string.
C-x C-b Fallback to non-ido version of current command.
C-t     Toggle regexp searching.
C-p     Toggle between substring and prefix matching.
C-c     Toggle case-sensitive searching of buffer names.
?       Show list of matching buffers in separate window.
C-x C-f Drop into ‘ido-find-file’.
C-k     Kill buffer at head of buffer list.
C-a     Toggle ignoring buffers listed in ‘ido-ignore-buffers’.
</pre>
</div>
</div>
</div>
<div id="outline-container-org05e9b66" class="outline-3">
<h3 id="org05e9b66"><span class="section-number-3">5.3</span> References</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li><a href="http://ergoemacs.org/emacs/emacs_ido_mode.html">http://ergoemacs.org/emacs/emacs_ido_mode.html</a></li>
<li>C-h f ido-find-file RET</li>
<li>C-h f ido-switch-buffer RET</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8c0f187" class="outline-2">
<h2 id="org8c0f187"><span class="section-number-2">6</span> Lisp Debugging</h2>
</div>
<div id="outline-container-org303958b" class="outline-2">
<h2 id="org303958b"><span class="section-number-2">7</span> Emacs/Elisp Troubleshooting</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org1c5a9db" class="outline-3">
<h3 id="org1c5a9db"><span class="section-number-3">7.1</span> Font test</h3>
<div class="outline-text-3" id="text-7-1">
<dl class="org-dl">
<dt><code>C-h h</code></dt><dd>view-hello-file</dd>
</dl>
</div>
</div>
<div id="outline-container-org7b43a1a" class="outline-3">
<h3 id="org7b43a1a"><span class="section-number-3">7.2</span> Controlled startup</h3>
<div class="outline-text-3" id="text-7-2">
<p>
See <a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Batch-execution">(org) Batch execution</a> for an example using <code>-Q</code>, <code>--batch</code> and
<code>--eval</code> flags.
</p>
</div>
</div>
</div>
<div id="outline-container-org7ded88d" class="outline-2">
<h2 id="org7ded88d"><span class="section-number-2">8</span> References</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://github.com/chrisdone/elisp-guide">https://github.com/chrisdone/elisp-guide</a></li>
<li><code>M-:</code> then <code>(info-other-window "(emacs) Specifying File Variables")</code></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: user01</p>
<p class="date">Created: 2020-09-12 Sat 15:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
